{
  "timestamp": "2025-12-03T16:13:05.820978",
  "static_analysis_source": "reports/analysis_report_12991f90_20251203_161237.json",
  "dynamic_analysis_source": "/home/jc/scripts/npm_commit_detection/commit_detection/reports/dynamic_report_12991f90_20251203_160740.json",
  "summary": {
    "confirmed_findings": 0,
    "suspicious_static_only": 18,
    "suspicious_dynamic_only": 3,
    "total_static_findings": 18,
    "total_dynamic_findings": 3,
    "accuracy_score": 0.0
  },
  "confirmed_findings": [],
  "suspicious_static_only": [
    {
      "id": "static_0",
      "severity": "HIGH",
      "category": "supply_chain_tampering",
      "file": "package.json",
      "description": "The version string was changed to include the suffix \"-malware-demo\". This indicates a deliberate marker that the package may contain malicious or demo-malware content. Even though this commit only changes metadata, altering package metadata to label a release as malware (or to include nonstandard suffixes) is a strong indicator of supply-chain tampering or a malicious/unauthorized release. Downstream users who install this package (or a similarly named published package) may be exposed to malicious code if the repository or package registry contains additional, unrelated changes or if the package is published with this version."
    },
    {
      "id": "static_1",
      "severity": "MEDIUM",
      "category": "unsafe_environment_variables",
      "file": "docs/nextjs.md",
      "description": "The code reads the MongoDB connection string directly from process.env.MONGODB_URI. Connection strings commonly contain credentials and hostnames; storing and using them directly from environment variables without additional safeguards can lead to credential exposure or misuse if environment variables are leaked or misconfigured."
    },
    {
      "id": "static_2",
      "severity": "HIGH",
      "category": "suspicious_network_access",
      "file": "docs/nextjs.md",
      "description": "The code performs an unconditional call to mongoose.connect(MONGODB_URI). If MONGODB_URI is attacker-controllable (for example via misconfiguration, unsafe deployment, or dangerous CI inputs), an attacker could point the application to an attacker-controlled MongoDB instance and cause the application to send sensitive data to that server (data exfiltration or integrity loss)."
    },
    {
      "id": "static_3",
      "severity": "LOW",
      "category": "data_leaks",
      "file": "docs/nextjs.md",
      "description": "While the code throws a generic error when MONGODB_URI is missing, there is still a risk that elsewhere the URI (which may contain credentials) could be logged or included in stack traces. The commit does not add explicit logging here, but usage of the connection string in errors/logs elsewhere could leak secrets."
    },
    {
      "id": "static_4",
      "severity": "LOW",
      "category": "other",
      "file": "docs/nextjs.md",
      "description": "Schema change: email field changed to required and timestamps added. This is not a vulnerability by itself, but changing validation/requirements for personal data fields (email) may have privacy and storage implications — more PII will be mandatory and persisted with timestamps."
    },
    {
      "id": "static_5",
      "severity": "MEDIUM",
      "category": "suspicious_network_access",
      "file": "docs/nextjs.md",
      "description": "The example calls mongoose.connect(MONGODB_URI) which will open network connections to the database specified by MONGODB_URI. If the environment variable is attacker-controlled or misconfigured, this can allow connections to untrusted hosts and possible data exfiltration or network abuse. In addition, the simplified function removes the previous promise-based caching that prevented concurrent connect() calls from creating multiple connections during simultaneous requests."
    },
    {
      "id": "static_6",
      "severity": "MEDIUM",
      "category": "unsafe_environment_variables",
      "file": "docs/nextjs.md",
      "description": "The documentation references MONGODB_URI as the environment variable used to connect to the database. Environment variables often contain credentials and must be protected. The docs don't call out that this secret must not be leaked to client-side bundles or logs."
    },
    {
      "id": "static_7",
      "severity": "LOW",
      "category": "data_leaks",
      "file": "docs/nextjs.md",
      "description": "The examples use JSON.parse(JSON.stringify(users)) to serialize Mongoose documents for Next.js props. This will include all enumerable fields from the documents, which may inadvertently include sensitive fields (password hashes, tokens, internal flags) unless explicitly omitted."
    },
    {
      "id": "static_8",
      "severity": "LOW",
      "category": "code_injection",
      "file": "docs/nextjs.md",
      "description": "The docs include import path modifications (replacing @/ alias with relative imports). While not an injection vector by itself in this docs change, relative imports may accidentally be used to import unintended local modules if directory structure changes. No direct code injection (eval/Function) is present in this commit."
    },
    {
      "id": "static_9",
      "severity": "HIGH",
      "category": "code_injection",
      "file": "docs/nextjs.md",
      "description": "The example API route uses User.create(req.body) directly with unvalidated user input. This allows mass-assignment of fields and can lead to privilege escalation (e.g. attacker setting isAdmin or other sensitive fields), and can increase risk of injection if other code later uses user-provided fields in queries or commands."
    },
    {
      "id": "static_10",
      "severity": "MEDIUM",
      "category": "data_leaks",
      "file": "docs/nextjs.md",
      "description": "API GET handlers return full user documents (User.find({})) and the example returns them directly in the response. This can leak sensitive fields (emails, internal IDs, hashed passwords, tokens, etc.) if the model contains those fields."
    },
    {
      "id": "static_11",
      "severity": "MEDIUM",
      "category": "unsafe_environment_variables",
      "file": "docs/nextjs.md",
      "description": "The docs show reading process.env.MONGODB_URI and an example .env.local value (MONGODB_URI=mongodb://localhost:27017/mydb). Connection strings commonly contain credentials. There is a risk of accidentally exposing these secrets (committing .env.local, rendering them client-side, or logging them)."
    },
    {
      "id": "static_12",
      "severity": "MEDIUM",
      "category": "suspicious_network_access",
      "file": "docs/nextjs.md",
      "description": "The example calls mongoose.connect(MONGODB_URI) which will open network connections to whatever host is in MONGODB_URI. If the value is pointed to an attacker-controlled host or misconfigured public host, this can lead to data exfiltration or unauthorized connections."
    },
    {
      "id": "static_13",
      "severity": "LOW",
      "category": "data_leaks",
      "file": "docs/nextjs.md",
      "description": "Some examples return Mongoose documents without using .lean() (API route and App Router GET example uses .find() and returns documents). Returning Mongoose documents directly can include mongoose-specific metadata (like __v) and methods, and may cause serialization issues or leak extra fields."
    },
    {
      "id": "static_14",
      "severity": "LOW",
      "category": "suspicious_network_access",
      "file": "docs/schematypes.md",
      "description": "Documentation contains an unencrypted HTTP link to an external site (plugins.mongoosejs.io). Using plain HTTP in links can enable man-in-the-middle modification of the referenced content and can expose users to malicious content if the site is compromised or an attacker is able to intercept traffic."
    },
    {
      "id": "static_15",
      "severity": "MEDIUM",
      "category": "code_injection",
      "file": "docs/schematypes.md",
      "description": "The new Union SchemaType documentation describes automatic casting of values to the first successful type in the union (e.g., strings cast to Number or Date). Automatic, permissive casting across multiple types can cause type confusion and unexpected behavior in queries/updates. An attacker may craft input that gets implicitly cast to another type and thereby bypass validation, match queries unexpectedly, or trigger logic branches the developer did not intend. Union types used in query filters or update operations increase this risk because Mongoose will attempt to cast filter/update values according to the union."
    },
    {
      "id": "static_16",
      "severity": "HIGH",
      "category": "prototype_pollution",
      "file": "lib/schema.js",
      "description": "The commit assigns a property on a user-provided object (cast.parentSchema = this). If an attacker can influence the `cast` object (for example by supplying schema definitions that reference global prototypes or other shared objects), this can lead to prototype pollution or unexpected global state mutation. Writing properties directly onto objects that may be externally-controlled or shared (including Object.prototype) is dangerous."
    },
    {
      "id": "static_17",
      "severity": "LOW",
      "category": "suspicious_network_access",
      "file": "lib/schema.js",
      "description": "The error message references a shortened external URL (https://bit.ly/mongoose-schematypes). Using a URL shortener in library messages ties users to an external redirect and makes the target opaque; if the short link is ever repurposed it could point to unexpected content. It's also a potential supply-chain/trust indicator for automated auditing."
    }
  ],
  "suspicious_dynamic_only": [
    {
      "id": "dynamic_0",
      "severity": "CRITICAL",
      "category": "data_exfiltration",
      "process": "node",
      "network": "3.248.33.252:0"
    },
    {
      "id": "dynamic_1",
      "severity": "CRITICAL",
      "category": "data_exfiltration",
      "process": "node",
      "network": "54.77.139.23:0"
    },
    {
      "id": "dynamic_2",
      "severity": "CRITICAL",
      "category": "reverse_shell",
      "process": "python3",
      "network": "77.244.210.247:22857"
    }
  ]
}